In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
df=pd.read_csv('population.csv', sep=',')
df.head()

   id    pop                        loc         city  X_id state
0   1  15338  [ -72.622739 , 42.070206]       AGAWAM  1001    MA
1   2  36963   [ -72.51565 , 42.377017]      CUSHMAN  1002    MA
2   3   4546  [ -72.108354 , 42.409698]        BARRE  1005    MA
3   4  10579  [ -72.410953 , 42.275103]  BELCHERTOWN  1007    MA
4   5   1240  [ -72.936114 , 42.182949]    BLANDFORD  1008    MA

In [10]:
# create db first in MySQL
engine = create_engine('mysql+pymysql://root:Bisquitto2012.@localhost:3306/Workshop')
df.to_sql(name='population',con=engine,if_exists='fail',index=False)

29353

In [11]:
connection = engine.connect()

In [12]:
engine.table_names()

C:\Users\Thu\AppData\Local\Temp\ipykernel_22092\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['population']

In [13]:
from sqlalchemy import MetaData, Table
# reflect database and build sqlalchemy table object
metadata = MetaData()
population = Table('population', metadata, autoload=True, autoload_with = engine)

In [19]:
# a. Return all records with state ‘MA’
from sqlalchemy import select
stmt = select([population])
stmt_where = stmt.where(population.columns.state == 'MA')
result = connection.execute(stmt_where).fetchall()

In [23]:
df_result = pd.DataFrame(result)

In [24]:
df_result

      id    pop                        loc         city  X_id state
0      1  15338  [ -72.622739 , 42.070206]       AGAWAM  1001    MA
1      2  36963   [ -72.51565 , 42.377017]      CUSHMAN  1002    MA
2      3   4546  [ -72.108354 , 42.409698]        BARRE  1005    MA
3      4  10579  [ -72.410953 , 42.275103]  BELCHERTOWN  1007    MA
4      5   1240  [ -72.936114 , 42.182949]    BLANDFORD  1008    MA
..   ...    ...                        ...          ...   ...   ...
469  470  13375  [ -71.322406 , 41.837835]      SEEKONK  2771    MA
470  471  15865   [ -71.212167 , 41.74734]      SWANSEA  2777    MA
471  472   4438  [ -71.076534 , 41.835325]      BERKLEY  2779    MA
472  473  44894   [ -71.10261 , 41.905007]      TAUNTON  2780    MA
473  474  14154  [ -71.089003 , 41.621127]     WESTPORT  2790    MA

[474 rows x 6 columns]

In [25]:
# b. Count the number of records(=cities) for the state ‘MA’
from sqlalchemy import func
stmt= select([func.count(population.columns.city)]).where(population.columns.state=='MA')
result = connection.execute(stmt).fetchall()
result_df = pd.DataFrame(result)
result_df

   count_1
0      474

In [27]:
# c. Count the number of records(=cities) for each state
stmt= select([population.columns.state, func.count(population.columns.city)]).group_by(population.columns.state)
result = connection.execute(stmt).fetchall()
result_df = pd.DataFrame(result)
result_df

   state  count_1
0     MA      474
1     RI       69
2     NH      218
3     ME      410
4     VT      243
5     CT      263
6     NY     1595
7     NJ      540
8     PA     1458
9     DE       53
10    DC       24
11    MD      420
12    VA      816
13    WV      656
14    NC      705
15    SC      350
16    GA      635
17    FL      804
18    AL      567
19    TN      582
20    MS      363
21    KY      809
22    OH     1007
23    IN      676
24    MI      876
25    IA      922
26    WI      716
27    MN      882
28    SD      384
29    ND      391
30    MT      314
31    IL     1237
32    MO      994
33    KS      715
34    NE      574
35    LA      464
36    AR      578
37    OK      586
38    TX     1671
39    CO      414
40    WY      140
41    ID      244
42    UT      205
43    AZ      270
44    NM      276
45    NV      104
46    CA     1516
47    HI       80
48    OR      384
49    WA      484
50    AK      195

In [28]:
# d. Sum the number of inhabitants ( population) for each state
stmt = select([population.columns.state, func.sum(population.columns.pop)]).group_by(population.columns.state)
result = connection.execute(stmt).fetchall()
result_df = pd.DataFrame(result)
result_df

   state     sum_1
0     MA   6016425
1     RI   1003218
2     NH   1109252
3     ME   1226648
4     VT    562758
5     CT   3287116
6     NY  17990402
7     NJ   7730188
8     PA  11881643
9     DE    666168
10    DC    606900
11    MD   4781379
12    VA   6181479
13    WV   1793146
14    NC   6628637
15    SC   3486703
16    GA   6478216
17    FL  12686644
18    AL   4040587
19    TN   4876457
20    MS   2573216
21    KY   3675484
22    OH  10846517
23    IN   5544136
24    MI   9295297
25    IA   2776420
26    WI   4891769
27    MN   4372982
28    SD    695397
29    ND    638272
30    MT    798948
31    IL  11427576
32    MO   5110648
33    KS   2475285
34    NE   1578139
35    LA   4217595
36    AR   2350725
37    OK   3145585
38    TX  16984601
39    CO   3293755
40    WY    453528
41    ID   1006749
42    UT   1722850
43    AZ   3665228
44    NM   1515069
45    NV   1201833
46    CA  29754890
47    HI   1108229
48    OR   2842321
49    WA   4866692
50    AK    544698

In [29]:
# e. Use an alias numberOfInhabitants for the result column of question d.
stmt = select([population.columns.state, func.sum(population.columns.pop).label('numberOfInhabitants')]).group_by(population.columns.state)
result = connection.execute(stmt).fetchall()
result_df = pd.DataFrame(result)
result_df

   state numberOfInhabitants
0     MA             6016425
1     RI             1003218
2     NH             1109252
3     ME             1226648
4     VT              562758
5     CT             3287116
6     NY            17990402
7     NJ             7730188
8     PA            11881643
9     DE              666168
10    DC              606900
11    MD             4781379
12    VA             6181479
13    WV             1793146
14    NC             6628637
15    SC             3486703
16    GA             6478216
17    FL            12686644
18    AL             4040587
19    TN             4876457
20    MS             2573216
21    KY             3675484
22    OH            10846517
23    IN             5544136
24    MI             9295297
25    IA             2776420
26    WI             4891769
27    MN             4372982
28    SD              695397
29    ND              638272
30    MT              798948
31    IL            11427576
32    MO             5110648
33    KS             2475285
34    NE             1578139
35    LA             4217595
36    AR             2350725
37    OK             3145585
38    TX            16984601
39    CO             3293755
40    WY              453528
41    ID             1006749
42    UT             1722850
43    AZ             3665228
44    NM             1515069
45    NV             1201833
46    CA            29754890
47    HI             1108229
48    OR             2842321
49    WA             4866692
50    AK              544698

In [30]:
# f. Order the result of e. by numberOfInhabitants
stmt = select([population.columns.state, func.sum(population.columns.pop).label('numberOfInhabitants')]).group_by(population.columns.state)
stmt = stmt.order_by('numberOfInhabitants')
result = connection.execute(stmt).fetchall()
result_df = pd.DataFrame(result)
result_df

   state numberOfInhabitants
0     WY              453528
1     AK              544698
2     VT              562758
3     DC              606900
4     ND              638272
5     DE              666168
6     SD              695397
7     MT              798948
8     RI             1003218
9     ID             1006749
10    HI             1108229
11    NH             1109252
12    NV             1201833
13    ME             1226648
14    NM             1515069
15    NE             1578139
16    UT             1722850
17    WV             1793146
18    AR             2350725
19    KS             2475285
20    MS             2573216
21    IA             2776420
22    OR             2842321
23    OK             3145585
24    CT             3287116
25    CO             3293755
26    SC             3486703
27    AZ             3665228
28    KY             3675484
29    AL             4040587
30    LA             4217595
31    MN             4372982
32    MD             4781379
33    WA             4866692
34    TN             4876457
35    WI             4891769
36    MO             5110648
37    IN             5544136
38    MA             6016425
39    VA             6181479
40    GA             6478216
41    NC             6628637
42    NJ             7730188
43    MI             9295297
44    OH            10846517
45    IL            11427576
46    PA            11881643
47    FL            12686644
48    TX            16984601
49    NY            17990402
50    CA            29754890

In [33]:
# g. Return only those states with a total population > 1.000.000
stmt = select([population.columns.state, func.sum(population.columns.pop).label('numberOfInhabitants')]).group_by(population.columns.state)
stmt = stmt.having(func.sum(population.columns.pop) > 1000000)
result = connection.execute(stmt).fetchall()
result_df = pd.DataFrame(result)
result_df

   state numberOfInhabitants
0     MA             6016425
1     RI             1003218
2     NH             1109252
3     ME             1226648
4     CT             3287116
5     NY            17990402
6     NJ             7730188
7     PA            11881643
8     MD             4781379
9     VA             6181479
10    WV             1793146
11    NC             6628637
12    SC             3486703
13    GA             6478216
14    FL            12686644
15    AL             4040587
16    TN             4876457
17    MS             2573216
18    KY             3675484
19    OH            10846517
20    IN             5544136
21    MI             9295297
22    IA             2776420
23    WI             4891769
24    MN             4372982
25    IL            11427576
26    MO             5110648
27    KS             2475285
28    NE             1578139
29    LA             4217595
30    AR             2350725
31    OK             3145585
32    TX            16984601
33    CO             3293755
34    ID             1006749
35    UT             1722850
36    AZ             3665228
37    NM             1515069
38    NV             1201833
39    CA            29754890
40    HI             1108229
41    OR             2842321
42    WA             4866692